Repository: collective/pas.plugins.authomatic
Catalog: src/pas/plugins/authomatic/locales/*/LC_MESSAGES/pas.plugins.authomatic.po
Languages: de, es, fr, it, pt_br

source: Authomatic PAS Plugin
es: Plugin PAS Authomatic
it: Plugin PAS Authomatic
pt_br: Plugin PAS Authomatic

source: Authomatic PAS Plugin: uninstall
es: Complemento PAS Authomatic: desinstalar
pt_br: Plugin PAS Authomatic: Remover

source: Authomatic is not configured
es: Authomatic no esta configurado
pt_br: Authomatic não está configurado

source: Authomatic settings
pt_br: Configurações do Authomatic

source: Authomatic: Login with OAuth/OpenID 3rd party auth providers using the pas.plugins.authomatic add-on.
es: Authomatic: inicie sesión con proveedores de autenticación de terceros de OAuth/OpenID mediante el complemento pas.plugins.authomatic.
pt_br: Authomatic: Login com provedores OAuth/OpenID usando o complemento pas.plugins.authomatic.

source: Generator for Plone User IDs.
de: Generator für Plone User-Ids.
es: Generador de ID de usuario de Plone.
fr: Générateur pour les identifiants des utilisateurs Plone
it: Generazione degli User ID Plone.
pt_br: Gerador de IDs de usuários Plone

source: JSON configuration
de: JSON Konfiguration
es: Configuración JSON
fr: Configuration JSON
it: Configurazione JSON
pt_br: Configuração em JSON

source: PAS Authomatic Plugin Settings
de: Einstellungen für das PAS Authomatic Plugin
es: Configuración de complemento PAS Authomatic
fr: Paramètres pour l'addon PAS Authomatic
it: Impostazioni del Plugin PAS Authomatic
pt_br: Configurações do Plugin Authomatic

source: Provider User ID
de: User ID des Anbieters
es: User ID del provider
fr: Fournisseur d'identifiant utilisateur
it: User ID del provider
pt_br: ID de usuário do provedor

source: Provider User Name
es: Nombre de usuario del proveedor
fr: Fournisseur de nom d'utilisateur
pt_br: Nome de usuário do provedor

source: Provider User Name or User ID
pt_br: Nome de usuário ou ID do provedor

source: Provider not supported
es: Proveedor no compatible
pt_br: Provedor não suportado

source: Secret
de: Geheimes Wort
es: Secreto
pt_br: Segredo

source: UUID as User ID
de: UUID als User-ID
es: UUID como ID de Usuario
fr: UUID comme identifiant utilisateur
it: UUID come User ID
pt_br: ID de usuário como UUID

source: Uninstalls the pas.plugins.authomatic add-on. This REMOVES ALL USERS managed by this plugin!
es: Desinstala el complemento pas.plugins.authomatic. ¡Esto ELIMINA TODOS LOS USUARIOS administrados por este complemento!
pt_br: Remove o complemento pas.plugins.authomatic. (Isto removerá TODOS os usuários gerenciados por este plugin!

source: add_description
de: Wählen Sie einens dieser externen Authentisierungs-Anbieter
es: Elija uno de estos proveedores de autenticación externos
fr: Choisissez un fournisseur externe d'identification
pt_br: Escolha um dos serviços externos de autenticação

source: add_identity_title
de: Identität hinzufügen
es: Añadir identidad
fr: Ajouter une identité
pt_br: Adicionar identidade

source: added_identity
de: Indentität über den Anbieter ${provider} hinzugefügt
es: Añadir identidad proveída por ${provider}
fr: Identitée ajoutée fournie par ${provider}
it: Aggiunta identità fornita da ${provider}
pt_br: Adicionada identidade provida por ${provider}

source: help_json_config
es: Parámetros de configuración de los diferentes proveedores de autorización. Detalles en https://authomatic.github.io/authomatic/reference/providers.html - diferencia: "class_" tiene que ser una cadena, que luego se resuelve como una ruta punteada. También las secciones "display" y "propertymap" son especiales.
pt_br: Parâmetros de configuração para os diferentes provedores de autorização. Detalhes em https://authomatic.github.io/authomatic/reference/providers.html - diferença: "class_" deve ser uma string, que será resolvida como um caminho com pontos. Além disso, as seções "display" e "propertymap" são especiais.”

source: help_secret
de: Ein Zufalls-String, der zur Verschlüsselung des 'State' verwendet wird.
es: Alguna cadena aleatoria utilizada para cifrar el estado
fr: Chaîne de caractères aléatoire utilisée pour l'encryption
it: Una stringa casuale usata per criptare lo stato
pt_br: String aleatória utilizada para encriptar as informações de estado

source: help_userid_factory_name
de: Die User-Id ist sichtbar, wenn kein 'fullname' zugewiesen wurde und in einigen seltenen Fällen in der URL. Innerhalb von Plone wird sie zur zur Identifikation herangezogen.
es: Es visible si no se asigna ningún nombre completo y, en algunos casos excepcionales, en las URL. Es el identificador utilizado para el usuario dentro de Plone.
fr: Visible si le nom ne correspond pas ou dans de rares cas dans les URLs. Il s'agit de l'identifiant pour l'utilisateur dans Plone.
it: E' visibile quanto nessun nome utente è mappato e in quale raro caso negli URL. E' l'identificatore usato per l'utente all'interno di Plone.
pt_br: Visível caso nenhum 'nome completo' estiver mapeado e, em raros caso, nas URLs. É o identificador utilizado pelo usuário no site Plone.

source: invalid_cfg_empty_dict
de: Mindestens ein Anbieter muss konfiguriert werden.
es: Se debe configurar al menos un proveedor.
fr: Au moins un fournisseur doit être configuré
it: Deve essere configurato almeno un provider.
pt_br: Ao menos um provedor deve ser configurado.

source: invalid_cfg_no_dict
de: Die JSON Wurzel muss ein Mapping (Schlüssel zu Wert) sein.
es: La raíz JSON debe ser una asignación (dict)
fr: La racine du JSON doit être un dictionnaire
it: La radice JSON deve essere una struttura mapping (dizionario)
pt_br: A raiz fo JSON deve ser um mapeamento (dicionário)

source: invalid_json
de: Das JSON ist nicht gültig, der Parser meldet: {$message}
es: JSON no es válido, el analizador se quejó: ${message}
fr: le JSON n'est pas valide, erreur lors du traitement: ${message}
it: JSON invalido, parser riporta: {$message}
pt_br: JSON não é válido, mensagem do parser foi: ${message}

source: logged_in_with
de: Eingeloggt mit ${provider}
es: Iniciado sesión con ${provider}
fr: Connecté via ${provider}
it: Autenticato con ${provider}
pt_br: Autenticado com ${provider}

source: login_title
de: Einloggen mit
es: Inicia con
fr: Se connecter avec
it: Autenticazione usando
pt_br: Entrar com

source: redirecting
es: redirigir
pt_br: redirecionando

source: Authomatic: Login with OAuth/OpenID 3rd party auth providers.
de: Authomatic: Anmeldung über OAuth/OpenID Drittanbieter für Authentifizierung
it: Authomatic: Login attraverso credenziali OAuth/OpenID di terze parti
